{"slots":{"default":[[{"componentName":"qna"},"0-qna"],[{"title":"Learn From Blogs","componentName":"relatedarticles","articles":[{"title":"Fear & Greed","content":"<p><strong>Fear &amp; Greed</strong></p><p>We all are humans, and being emotional is a trait that comes along once you set your foot on this earth. Emotions are powerful feelings, a mental state that catches our mind and bends us in a particular direction. There are two influential emotions that drive the stock market.</p><p><strong>Fear</strong>: Fear does not need an introduction, when you are set to lose something you do not wish to, fear comes down catching you, making you feel restless, swaying you in making a choice. If you wish to stay in the market for the long run, try avoiding the trades that increase your fear.</p><p><strong>Greed</strong>: Everybody wants money! When you are trading in the market, you must always keep an eye on your holding capacity. If your holding capacity is low but greed is high, your losses may widen up.</p><p>Overcoming these two emotions will give you the ability to make the correct trades. Once you are determined to think clearly and not be manipulated by any emotion you will be able to make the trades that will benefit you in a real sense.<br>**</p><p><strong>How to overcome the Greed &amp; Fear</strong></p><ul><li>Keep in mind the controlled position size, don’t buy more than what you can now chew.</li><li>Understand the nature of short-term volatility.</li><li>Conduct sufficient research before making the investment.</li><li>Maintain a habit of investing in quality stocks.</li><li>Carry out the right temperament for a successful portfolio.</li></ul><p>One of the most important things to keep in mind while making a trade or an investment is that when someone makes quick money with bad behavior, they tend to lose it as quickly as well. Money management is as important as buy/sell strategies. The more of your money will be at the trade, the higher the impact greed and fear will have on you.</p><p>Before making a trade think about it, how is your trade taking place, Have you made the right calculations? Are you able to decide what emotions are playing the part behind that decision?</p>","slug":"/fear-greed","componentName":"article","updatedAt":"2022-10-04T17:14:15.164Z","image":{"name":"The Importance of Risk Management in Investing Journey.png","alternativeText":"The Importance of Risk Management in Investing Journey.png","caption":"The Importance of Risk Management in Investing Journey.png","width":812,"height":522,"formats":{"thumbnail":{"name":"thumbnail_The Importance of Risk Management in Investing Journey.png","hash":"thumbnail_The_Importance_of_Risk_Management_in_Investing_Journey_d2caf00358","ext":".png","mime":"image/png","width":243,"height":156,"size":32.81,"url":"/uploads/thumbnail_The_Importance_of_Risk_Management_in_Investing_Journey_d2caf00358.png"},"medium":{"name":"medium_The Importance of Risk Management in Investing Journey.png","hash":"medium_The_Importance_of_Risk_Management_in_Investing_Journey_d2caf00358","ext":".png","mime":"image/png","width":750,"height":482,"size":121.97,"url":"/uploads/medium_The_Importance_of_Risk_Management_in_Investing_Journey_d2caf00358.png"},"small":{"name":"small_The Importance of Risk Management in Investing Journey.png","hash":"small_The_Importance_of_Risk_Management_in_Investing_Journey_d2caf00358","ext":".png","mime":"image/png","width":500,"height":321,"size":77,"url":"/uploads/small_The_Importance_of_Risk_Management_in_Investing_Journey_d2caf00358.png"}},"hash":"The_Importance_of_Risk_Management_in_Investing_Journey_d2caf00358","ext":".png","mime":"image/png","size":13.7,"url":"/uploads/The_Importance_of_Risk_Management_in_Investing_Journey_d2caf00358.png","updatedAt":"2022-09-16T13:53:43.032Z"},"categories":[{"name":"Diversification","slug":"/categories/diversification","updatedAt":"2022-09-15T19:03:17.899Z"}],"author":{}},{"title":"Penny stocks","content":"<p>“There is no point in presenting yourself good on the outside</p><p>when you are not the same on the inside”</p><p>Penny stocks are the corporations that appear to be real, they pretend to be operating just like a normal company, but beneath it, there is no functionality. These companies generally have a market cap of below 100 Crore.</p><p>These organizations are listed just to show their online presence, they do not actually have anything behind them. There is no actual business taking place, you check their P&amp;L or Balance sheet and you will find no business happening in it. In most cases, you will find “0” revenue or very little sales, you can see and instantly recognise that something is wrong with it.</p><p>These companies are famous for “pump &amp; dump”. Carrying a fraud-oriented personality, most of the scams happen with these companies. In order to save your investment, you should always avoid investing in any such company that looks like a dummy corporation. In 99.99% of the cases, these companies are nothing but a trap!</p><p>Luckily, there are ways you can save yourself from falling into these kinds of traps and identifying these corporations. Below is the guide that you should follow in order to beat them.</p><p><strong>How to identify a penny stocks</strong></p><ul><li><strong>No or negligible revenue</strong></li></ul><p>Before investing in any company you must always look for if it is growing or not. Constant growth is always a sign of a brighter tomorrow. These kinds of companies generally do not have any revenue, year by year they are just carrying forward “0” revenue or very little sales that is barely noticeable.</p><ul><li><strong>Small market cap</strong></li></ul><p>A small market cap is a big red flag, Penny stocks always have a market cap of less than 100 Cr. A small market cap gives the manipulators a free hand to play around with its share price. Hence avoid investing in any such company.</p><ul><li><strong>Lesser number of investors</strong></li></ul><p>The lesser the number of investors, the easier it is to create and execute a scam. If the number of investors in the company is less than 5000 then you should keep a keen eye on the company.</p><ul><li><strong>No movement or abnormal movement in the share</strong></li></ul><p>Penny stocks have very less volume and movement in the share, they are generally fixed on a price, if you see a sudden spike in their price and a high volume then probably it's a scam created by manipulators.</p><p>Every investor in the market hopes to make a big return on his investment, not being able to recognise a trap can damage or wipe out one’s portfolio completely. Hence look at every aspect of the company before you make up your mind while investing in it. Stay away from investing in companies that have no growth or revenue.</p>","slug":"/penny-stocks","componentName":"article","updatedAt":"2022-10-04T16:59:57.476Z","image":{},"categories":{"data":[]},"author":{}},{"title":"Temperament","content":"<p>“Investing is not a game where the guy with the 160 IQ beats the guy with the 130 IQ. Once you have ordinary intelligence, what you need is the temperament to control the urges that get other people into trouble in investing.”</p><p>—Warren Buffett</p><p>Temperament is an aspect of your personality that involves emotions. There are multiple emotions we pass through depending on the situations around us. When it comes to the stock market, uncertainty, doubts, and regrets are the most common feelings that trigger our emotions. The decision we take is related to the personality we fall in, there are four common types of investors in the market.</p><p><strong>Risk-takers</strong> - The one who bets big time.</p><p><strong>Controlled Risk-takers</strong>- The one who is willing to take very less risk.</p><p><strong>Safe Buyers</strong> - The one who is not willing to take any risk</p><p><strong>Balanced Buyers</strong> - The one who moderately controls both sides.</p><p>The way you react to your emotions determines how long you’ll be able to stay in the market. Investing is not only about gaining financial knowledge but also about maintaining the right temperament. How you manage your money is as important as how you manage your emotions</p><p>As a human being, we are all bound to react, a 5-10% fluctuation in our portfolio can definitely make us happy or sad depending on its direction. But you must always keep in mind that the current price is the truth of the market, you can’t dwell in the past or the future because they don’t matter, the current moment is all that you have in your hands. To know your investing strategy better you can ask yourself these questions.</p><p>Ask yourself</p><p>What is my goal behind making this investment?</p><p>How long am I planning to stay invested?</p><p>What is the drawdown I’ll be able to handle?</p><p>What type of investor category do I fall into?</p><p>Next time when fear, greed, FOMO, panic, uncertainty or any other emotion tries to play with you, let discipline, rational thinking and self-awareness be your guard and help you square up the right decision.</p>","slug":"/temperament","componentName":"article","updatedAt":"2022-10-05T09:35:51.474Z","image":{"name":"temprament.png","alternativeText":"temprament.png","caption":"temprament.png","width":812,"height":522,"formats":{"thumbnail":{"name":"thumbnail_temprament.png","hash":"thumbnail_temprament_c87090e2f1","ext":".png","mime":"image/png","width":243,"height":156,"size":37.33,"url":"/uploads/thumbnail_temprament_c87090e2f1.png"},"medium":{"name":"medium_temprament.png","hash":"medium_temprament_c87090e2f1","ext":".png","mime":"image/png","width":750,"height":482,"size":165.65,"url":"/uploads/medium_temprament_c87090e2f1.png"},"small":{"name":"small_temprament.png","hash":"small_temprament_c87090e2f1","ext":".png","mime":"image/png","width":500,"height":321,"size":98.76,"url":"/uploads/small_temprament_c87090e2f1.png"}},"hash":"temprament_c87090e2f1","ext":".png","mime":"image/png","size":23.12,"url":"/uploads/temprament_c87090e2f1.png","updatedAt":"2022-10-05T09:35:48.255Z"},"categories":{"data":[]},"author":{}},{"title":"Self Awareness","content":"<p>Your financial literacy and perceptions help you to make your choices. The more self-aware you’ll become of your choices, the more precisely you’ll be able to look after your limits, your capabilities, and your blind spots. Knowing your weaknesses, you can work on them better to overcome or eliminate them.</p><p>Self-awareness is very important in the market, it helps you to observe your mistakes and stop repeating them. Learn the art of differentiating between a rational decision and an emotional decision. Take your decisions based on rational thinking rather than letting fear &amp; greed rule over your verdict.</p><p>Routes you can take to initiate your journey of self-awareness in the market, ask yourself these questions.</p><ul><li>How are you bringing money into the market, at what point ?</li><li>How are you exiting from the trades/ investments?</li><li>How are you deciding what quantity of the stocks will be suitable?</li><li>How are you choosing to withdraw your funds from the market?</li><li>What is your reaction when there is a fall, are you panicking?</li><li>Is gain making you greedy?</li></ul><p>The process of self-awareness will help you to</p><ul><li>Increase self-confidence</li><li>Take analytical decision</li><li>Reduce stress</li><li>Improve motivation</li><li>Build a dynamic approach</li></ul><p>Analyze your decision data to become more self-aware and make correct choices that can be rewarding to you. This journey of self-discovery is never-ending. Always look after your decisions to stay sane and make the required decisions in the market. Before making a trade ask yourself,  are you making a calculative move? Are you confident or are you truly self-aware?</p>","slug":"/self-awareness","componentName":"article","updatedAt":"2022-10-05T09:35:04.391Z","image":{"name":"Self Awareness.png","alternativeText":"Self Awareness.png","caption":"Self Awareness.png","width":812,"height":522,"formats":{"thumbnail":{"name":"thumbnail_Self Awareness.png","hash":"thumbnail_Self_Awareness_9f299a76f8","ext":".png","mime":"image/png","width":243,"height":156,"size":28.86,"url":"/uploads/thumbnail_Self_Awareness_9f299a76f8.png"},"medium":{"name":"medium_Self Awareness.png","hash":"medium_Self_Awareness_9f299a76f8","ext":".png","mime":"image/png","width":750,"height":482,"size":123.81,"url":"/uploads/medium_Self_Awareness_9f299a76f8.png"},"small":{"name":"small_Self Awareness.png","hash":"small_Self_Awareness_9f299a76f8","ext":".png","mime":"image/png","width":500,"height":321,"size":72.99,"url":"/uploads/small_Self_Awareness_9f299a76f8.png"}},"hash":"Self_Awareness_9f299a76f8","ext":".png","mime":"image/png","size":18.28,"url":"/uploads/Self_Awareness_9f299a76f8.png","updatedAt":"2022-09-16T13:57:13.360Z"},"categories":{"data":[]},"author":{}},{"title":"Volatility","content":"<p>Each asset has its own volatile nature based on its market cap and liquidity. Volatility shows the monetary risk associated with a share price, it shows the rate at which a share price can show a movement in a particular period of time.  Volatility can be measured statistically. To understand better you can remember the higher the volatility, the riskier the share.</p><p>If the price of a share fluctuates and touches new highs and lows in a shorter period of time, it can be said that it has higher volatility. And if the price of a share does not change much and stays steady, it can be said that it has low volatility.</p><p><strong>Measures of volatility</strong></p><p><strong>Beta</strong></p><p>Beta is a metric that compares a stock’s movements relative to the overall market, or a certain stock index.</p><p>A high beta stock tends to be more volatile than average, while a low-beta stock tends to be less volatile.</p><p><strong>Volatility Index (VIX)</strong></p><p>India VIX also called the fear index, represents the rank of volatility in the stock market. The volatility typically climbs upwards when there is uncertainty in the market.</p><p>India VIX does not tell you the direction of the market, it just indicates the intensity of the volatility that might impact the market in the coming days.</p><p>High VIX = High Volatility</p><p>Low VIX = Low Volatility</p><p>While Beta is an indicator of stocks, the Volatility Index (VIX) is an indicator of the entire stock index.</p><p><strong>Factors that can affect the volatility</strong></p><p>There are several factors that can play a role when it comes to affecting the volatility measures of a share. The most notable factors are as follows.</p><ul><li>Political factors</li><li>Industrial factors</li><li>Demand &amp; supply of the securities</li><li>Company related news</li></ul><p>Volatility affects you less when you have done enough research and you have full control over your position size, in this case, you can handle extreme volatility and hold your position. You must choose your stocks wisely to minimize the drawdowns. If you have small caps and micro caps as a major portion of your portfolio, you might see a 60-70% drawdown from the top bear market since small caps face a brutal drawdown against large caps. The preferred way can be balancing your portfolio with every category of share to avoid any mishap.</p><p>Volatility provides an opportunity in both uptrends and downtrends. For experienced investors, the right move can turn into an opportunity and benefit in a good way. For a long-term investor, volatility is nothing more than a noise, it is just a basic nature of the market and you have to learn to live with it, as stoic wisdom suggests “ Detach yourself from the daily price action, focus on underlying values &amp; fundamentals of your investment.”</p><p>If you are unsure of how a volatile works in a practical aspect, you can check our Volatility tool and measure the fluctuations of the market.</p>","slug":"/importance-of-volatility","componentName":"article","updatedAt":"2022-10-05T09:37:27.173Z","image":{"name":"volatility.png","alternativeText":"volatility.png","caption":"volatility.png","width":812,"height":522,"formats":{"thumbnail":{"name":"thumbnail_volatility.png","hash":"thumbnail_volatility_dcf34d64b7","ext":".png","mime":"image/png","width":243,"height":156,"size":34.6,"url":"/uploads/thumbnail_volatility_dcf34d64b7.png"},"medium":{"name":"medium_volatility.png","hash":"medium_volatility_dcf34d64b7","ext":".png","mime":"image/png","width":750,"height":482,"size":198.94,"url":"/uploads/medium_volatility_dcf34d64b7.png"},"small":{"name":"small_volatility.png","hash":"small_volatility_dcf34d64b7","ext":".png","mime":"image/png","width":500,"height":321,"size":105.69,"url":"/uploads/small_volatility_dcf34d64b7.png"}},"hash":"volatility_dcf34d64b7","ext":".png","mime":"image/png","size":42.31,"url":"/uploads/volatility_dcf34d64b7.png","updatedAt":"2022-10-05T09:37:21.195Z"},"categories":{"data":[]},"author":{}},{"title":"Guaranteed Return","content":"<p>To understand how the stock market gives returns, let’s first understand how the market functions in different scenarios. There are three primary phases of the stock market.</p><p><strong>Bull market</strong> - The price of the securities rises, and market conditions are favourable.</p><p><strong>Bear market</strong> - The economy starts receding and stocks lose their value.</p><p><strong>Sideways/kangaroo market</strong>- Prices keep on rising and falling but not in a consistent direction.</p><p>We all need lots of powerful long-range goals to help us past the short-term goals. If you look at the CAGR return of different assets in the long term and compare it with the short term, you will realise that it is very hard to predict how the market will float in the short term.</p><p>Example:</p><p>(3 different charts of the same asset- RIL)</p><p>5 year chart</p><p>1 year chart</p><p>1 week chart</p><p>Here you can see that it is very hard to make an assumption about how the stock will perform in the long term. The market keeps on fluctuating in different directions, in the short term everything looks haywire, but if you analyze from a long-term perspective you will be able to see the value of the asset has been increasing, it was just not visible on the surface level.</p><p><strong>(Illustration of below given numbers)</strong></p><p>1+1+1+1+1+1 =6</p><p>&amp;</p><p>1+3-2+4-2+2=6</p><p>Most people think the market functions similarly to the first calculation. They fail to understand that the market is never moving at one speed, their wealth will fluctuate with every mood the market goes through. Sometimes it can increase by multiples, while at other times it can decrease as well. Achieving your desired goal is the only thing that matters.</p><p>There are many fraudsters in the market that assure that they are able to provide guaranteed returns in the market. The truth is no one can predict how the market will be in the short run. If someone is offering a guaranteed return then either he is lying or he is fooling you for his own benefit. You should stay alert and not get lured into these types of traps. If you are letting anyone else manage your money on your behalf then don’t give anyone access to your account that is not registered with SEBI.</p>","slug":"/guaranteed-return","componentName":"article","updatedAt":"2022-10-04T17:09:47.936Z","image":{},"categories":{"data":[]},"author":{}}]},"1-relatedarticles"]]},"masterPage":"customlayout"}