{"items":[{"title":"Fear & Greed","content":"<p><strong>Fear &amp; Greed</strong></p><p>We all are humans, and being emotional is a trait that comes along once you set your foot on this earth. Emotions are powerful feelings, a mental state that catches our mind and bends us in a particular direction. There are two influential emotions that drive the stock market.</p><p><strong>Fear</strong>: Fear does not need an introduction, when you are set to lose something you do not wish to, fear comes down catching you, making you feel restless, swaying you in making a choice. If you wish to stay in the market for the long run, try avoiding the trades that increase your fear.</p><p><strong>Greed</strong>: Everybody wants money! When you are trading in the market, you must always keep an eye on your holding capacity. If your holding capacity is low but greed is high, your losses may widen up.</p><p>Overcoming these two emotions will give you the ability to make the correct trades. Once you are determined to think clearly and not be manipulated by any emotion you will be able to make the trades that will benefit you in a real sense.<br>**</p><p><strong>How to overcome the Greed &amp; Fear</strong></p><ul><li>Keep in mind the controlled position size, don’t buy more than what you can now chew.</li><li>Understand the nature of short-term volatility.</li><li>Conduct sufficient research before making the investment.</li><li>Maintain a habit of investing in quality stocks.</li><li>Carry out the right temperament for a successful portfolio.</li></ul><p>One of the most important things to keep in mind while making a trade or an investment is that when someone makes quick money with bad behavior, they tend to lose it as quickly as well. Money management is as important as buy/sell strategies. The more of your money will be at the trade, the higher the impact greed and fear will have on you.</p><p>Before making a trade think about it, how is your trade taking place, Have you made the right calculations? Are you able to decide what emotions are playing the part behind that decision?</p>","slug":"/fear-greed","componentName":"article","updatedAt":"2022-10-04T17:14:15.164Z","image":{"name":"The Importance of Risk Management in Investing Journey.png","alternativeText":"The Importance of Risk Management in Investing Journey.png","caption":"The Importance of Risk Management in Investing Journey.png","width":812,"height":522,"formats":{"thumbnail":{"name":"thumbnail_The Importance of Risk Management in Investing Journey.png","hash":"thumbnail_The_Importance_of_Risk_Management_in_Investing_Journey_d2caf00358","ext":".png","mime":"image/png","width":243,"height":156,"size":32.81,"url":"/uploads/thumbnail_The_Importance_of_Risk_Management_in_Investing_Journey_d2caf00358.png"},"medium":{"name":"medium_The Importance of Risk Management in Investing Journey.png","hash":"medium_The_Importance_of_Risk_Management_in_Investing_Journey_d2caf00358","ext":".png","mime":"image/png","width":750,"height":482,"size":121.97,"url":"/uploads/medium_The_Importance_of_Risk_Management_in_Investing_Journey_d2caf00358.png"},"small":{"name":"small_The Importance of Risk Management in Investing Journey.png","hash":"small_The_Importance_of_Risk_Management_in_Investing_Journey_d2caf00358","ext":".png","mime":"image/png","width":500,"height":321,"size":77,"url":"/uploads/small_The_Importance_of_Risk_Management_in_Investing_Journey_d2caf00358.png"}},"hash":"The_Importance_of_Risk_Management_in_Investing_Journey_d2caf00358","ext":".png","mime":"image/png","size":13.7,"url":"/uploads/The_Importance_of_Risk_Management_in_Investing_Journey_d2caf00358.png","updatedAt":"2022-09-16T13:53:43.032Z"},"categories":[{"name":"Diversification","slug":"/categories/diversification","updatedAt":"2022-09-15T19:03:17.899Z"}],"author":{}},{"title":"Introduction to Finance","content":"<p>##What are Financial Markets?</p><p>Financial Market refers to a marketplace or a system that allows buyers and sellers to trade. There are different types of instruments used according to one’s goal and risk appetite.</p><p>##Instruments:<br>Below are some of the most preferred instruments in the financial world where daily numerous trades take place worldwide. You can understand them better if you imagine the financial world as an amusement park and all the instruments as different rides, the higher thrill the higher returns. Tighten up your seatbelts and let’s dive in!</p><pre><code>        ( Graphics ; amusement park of financial , Instruments image format  )</code></pre><p>##Debt<br>For those who do not want to take a big risk, debt provides fixed income along with protection on the investment. You can look at debt as a safe joyride that offers less excitement and more of just an experience, while it might sound dull, you can experience it if you are afraid of roller coasters!</p><p>##Gold<br>Due to its high reliability it is also known as one of the safest investments. Gold can be compared to a joyride that can guarantee that you’ll get some tickles in your body, You’ll enjoy it and might consider taking the same experience again in the future.</p><p>##Equity<br>Even though somewhat risky, people choose it to create wealth in the long run. Equity is a big bull standing in front of you! (Pun Intended) You can sit on it for a wild ride and if you know the right tricks, you can come a long way!</p><p>##Crypto<br>The optimists and early adopters who bet on the future and are ready to take high risk with high volatility. The wildest roller coasters of the park, everyone has an eye on it but few are willing to take the risk and hop in, it might give you a thrill or it might even bring you down.</p><p>You need to acquire the right knowledge before making your investment. Many aspects such as your financial condition, your risk-taking ability, your future goals, and your timeline of investment play a part in shaping your investment return.</p><p>You also need to understand every aspect of the market to stay sane during ups and downs and make the right choice whenever required.</p><p>Risky bets payoff better but at the same time, one wrong move and you can damage yourself in a dire way. The best trade in the market is always based on your rational thinking to judge the future of a high-risk asset but with the right way of allocating the asset in such a way that you can hold it for a longer period of time without worrying about it.</p>","slug":"/blog/fear-greed-23","componentName":"article","updatedAt":"2022-09-16T14:02:51.916Z","image":{"name":"introduction to finance.png","alternativeText":"introduction to finance.png","caption":"introduction to finance.png","width":812,"height":522,"formats":{"thumbnail":{"name":"thumbnail_introduction to finance.png","hash":"thumbnail_introduction_to_finance_e8f888b2d3","ext":".png","mime":"image/png","width":243,"height":156,"size":38.74,"url":"/uploads/thumbnail_introduction_to_finance_e8f888b2d3.png"},"medium":{"name":"medium_introduction to finance.png","hash":"medium_introduction_to_finance_e8f888b2d3","ext":".png","mime":"image/png","width":750,"height":482,"size":255.43,"url":"/uploads/medium_introduction_to_finance_e8f888b2d3.png"},"small":{"name":"small_introduction to finance.png","hash":"small_introduction_to_finance_e8f888b2d3","ext":".png","mime":"image/png","width":500,"height":321,"size":128.17,"url":"/uploads/small_introduction_to_finance_e8f888b2d3.png"}},"hash":"introduction_to_finance_e8f888b2d3","ext":".png","mime":"image/png","size":61,"url":"/uploads/introduction_to_finance_e8f888b2d3.png","updatedAt":"2022-09-16T14:02:48.651Z"},"categories":[{"name":"Diversification","slug":"/categories/diversification","updatedAt":"2022-09-15T19:03:17.899Z"},{"name":"Risk Rewards","slug":"/categories/risk-rewards","updatedAt":"2022-09-15T19:04:23.787Z"},{"name":"Volatility","slug":"/categories/volatility","updatedAt":"2022-09-15T18:59:11.805Z"},{"name":"Position Sizing","slug":"/categories/position-sizing","updatedAt":"2022-09-15T21:08:40.237Z"},{"name":"Risk Management","slug":"/categories/risk-management","updatedAt":"2022-09-15T21:06:24.842Z"}],"author":{}},{"title":"Penny stocks","content":"<p>“There is no point in presenting yourself good on the outside</p><p>when you are not the same on the inside”</p><p>Penny stocks are the corporations that appear to be real, they pretend to be operating just like a normal company, but beneath it, there is no functionality. These companies generally have a market cap of below 100 Crore.</p><p>These organizations are listed just to show their online presence, they do not actually have anything behind them. There is no actual business taking place, you check their P&amp;L or Balance sheet and you will find no business happening in it. In most cases, you will find “0” revenue or very little sales, you can see and instantly recognise that something is wrong with it.</p><p>These companies are famous for “pump &amp; dump”. Carrying a fraud-oriented personality, most of the scams happen with these companies. In order to save your investment, you should always avoid investing in any such company that looks like a dummy corporation. In 99.99% of the cases, these companies are nothing but a trap!</p><p>Luckily, there are ways you can save yourself from falling into these kinds of traps and identifying these corporations. Below is the guide that you should follow in order to beat them.</p><p><strong>How to identify a penny stocks</strong></p><ul><li><strong>No or negligible revenue</strong></li></ul><p>Before investing in any company you must always look for if it is growing or not. Constant growth is always a sign of a brighter tomorrow. These kinds of companies generally do not have any revenue, year by year they are just carrying forward “0” revenue or very little sales that is barely noticeable.</p><ul><li><strong>Small market cap</strong></li></ul><p>A small market cap is a big red flag, Penny stocks always have a market cap of less than 100 Cr. A small market cap gives the manipulators a free hand to play around with its share price. Hence avoid investing in any such company.</p><ul><li><strong>Lesser number of investors</strong></li></ul><p>The lesser the number of investors, the easier it is to create and execute a scam. If the number of investors in the company is less than 5000 then you should keep a keen eye on the company.</p><ul><li><strong>No movement or abnormal movement in the share</strong></li></ul><p>Penny stocks have very less volume and movement in the share, they are generally fixed on a price, if you see a sudden spike in their price and a high volume then probably it's a scam created by manipulators.</p><p>Every investor in the market hopes to make a big return on his investment, not being able to recognise a trap can damage or wipe out one’s portfolio completely. Hence look at every aspect of the company before you make up your mind while investing in it. Stay away from investing in companies that have no growth or revenue.</p>","slug":"/penny-stocks","componentName":"article","updatedAt":"2022-10-04T16:59:57.476Z","image":{},"categories":{"data":[]},"author":{}},{"title":"Position sizing & holding capacity","content":"<p>Position sizing refers to the size of the position within a portfolio. It depends on your total investing capacity and the number of units you are acquiring of any particular stock. Getting the correct position of a stock is important to ensure your stay in the market for the long run.</p><p>Your holding capacity increases for the long term when you have control over your investment.</p><p><strong>Example:</strong></p><p>If you’ve invested all of your money in a single stock, you won’t be able to enjoy its entire gain even if the stock gives you a 200% gain, you’ll constantly feel the need to sell it off and recover your money+gain from that investment. If there are chances of that stock going higher, your subconsciousness might force you to move immediately. In another scenario, if your investment is down by 50% you will worry the entire time for your stock to go high so that you can at least recover your initial investment.</p><p>The concept of correct position sizing is fundamental for any sort of investment. The most extraordinary gains are made in the market in less than 1% of days, but the catch is that we don’t know what that 1% of days are, so staying invested for a long term can work in our benefit, and to stay invested for a long term holding the right position sizing is important. It may happen that in many cases holding the right position size can be more important than the selection of stock.</p><p><strong>(The table made by Raj/Yaman will be used here)</strong></p><p>Here you can see there are four different parameters that take place when you are investing. Namely your position in the stock, volatility of your portfolio, the impact of fear &amp; greed, and your holding capacity. The importance of every parameter cannot be overstated. Whenever one portfolio starts to increase, the rest three start to change as well. A 2% allocation to an investment won’t show any big return on your overall portfolio, while a 100% allocation to only one stock will make your entire portfolio volatile and decrease your holding capacity, not to mention the sleepless nights due to fear. You must find the right balance to work out your holding capacity that also keeps your fear &amp; greed in control.</p><p>Use the position sizing tool to ensure you are in the right position. Discover how to find the perfect balance so you can achieve your goals.</p>","slug":"/position-sizing","componentName":"article","updatedAt":"2022-10-05T09:33:28.091Z","image":{"name":"position sizing.png","alternativeText":"position sizing.png","caption":"position sizing.png","width":812,"height":522,"formats":{"thumbnail":{"name":"thumbnail_position sizing.png","hash":"thumbnail_position_sizing_7db33f25a6","ext":".png","mime":"image/png","width":243,"height":156,"size":46.21,"url":"/uploads/thumbnail_position_sizing_7db33f25a6.png"},"medium":{"name":"medium_position sizing.png","hash":"medium_position_sizing_7db33f25a6","ext":".png","mime":"image/png","width":750,"height":482,"size":256.49,"url":"/uploads/medium_position_sizing_7db33f25a6.png"},"small":{"name":"small_position sizing.png","hash":"small_position_sizing_7db33f25a6","ext":".png","mime":"image/png","width":500,"height":321,"size":137.52,"url":"/uploads/small_position_sizing_7db33f25a6.png"}},"hash":"position_sizing_7db33f25a6","ext":".png","mime":"image/png","size":52.86,"url":"/uploads/position_sizing_7db33f25a6.png","updatedAt":"2022-10-05T09:33:21.668Z"},"categories":{"data":[]},"author":{}},{"title":"Risk reward","content":"<p>Risk/reward is one of the most important parts of risk management. The risk-reward ratio suggests the risk you are willing to take in order to gain a reward from your investment. This ratio is calculated on the future prediction price of a stock.</p><p>Risk reward ratio is one of the most important tools for the trader to measure their return against the risk they are willing to take into the market</p><p>Every instrument in the financial world carries a different speed of volatility therefore every instrument comes with a different type of risk associated with it, it depends on your choice of how much risk you are willing to take for the reward that you are expecting. High-risk assets can offer high rewards, but at the same time, they can quickly go from positive to negative, so your capital allocation in such assets should be lower. You must understand that if you are making a very risky bet that might reward you well, allocate a small amount for it, so if you win, you get a good reward and if you lose, you can bear that loss.</p><p>There are main 3 types of instrument that trades on the stock market</p><p><strong>Options:</strong>- Options are a type of derivative that allows the investor to deduce the future price of a stock. The investor can speculate on the increasing price for a “call option” or decreasing price for a “put option”. They come with a monthly expiry date and can be treated as a high-risk-high reward instrument. Here time plays a major role in the fluctuation of its price.</p><p><strong>Future:</strong>-  Futures are a type of derivative contract that binds the sellers and buyers to execute a trade at a predetermined price regardless of the market price of the stock. Future trades work on leverage. Here the investor can multiply his buying capacity by guaranteeing some portion of his investment.</p><p><strong>Cash market</strong>:- The cash market is the commodities market where different types of assets are purchased and sold. Here you purchase the stock at its market price. It is the simplest form of trading in the market.</p><p>Supposably you are making an investment in a stock that is currently valued at ₹100/-</p><p>You are putting your stop loss at ₹80/- and assuming that the stock will reach ₹140/-</p><p>Here you are willing to take a risk of ₹20/-  in the hope to gain ₹40/-</p><p>Hence your risk/reward ratio is 1:2</p><p>The higher the risk-higher the reward that does not mean you should just bet everything while investing. You must allocate a small portion of your entire investment amount, so even if you lose there are no regrets. You must follow the right position sizing before making your investment.</p><p>You can’t win both ways, low risk and high reward are not possible, you have to put your neck on the blade if you want to win a higher reward, but at the same time, you must keep in mind not to get so close that you cut your throat. To test your waters you can visit Abacus tools and find practice yourself to find how different aspects can affect your portfolio.</p>","slug":"/risk-rewards","componentName":"article","updatedAt":"2022-10-05T09:34:33.259Z","image":{"name":"Risk reward.png","alternativeText":"Risk reward.png","caption":"Risk reward.png","width":812,"height":522,"formats":{"thumbnail":{"name":"thumbnail_Risk reward.png","hash":"thumbnail_Risk_reward_2707868678","ext":".png","mime":"image/png","width":243,"height":156,"size":23.45,"url":"/uploads/thumbnail_Risk_reward_2707868678.png"},"medium":{"name":"medium_Risk reward.png","hash":"medium_Risk_reward_2707868678","ext":".png","mime":"image/png","width":750,"height":482,"size":117.2,"url":"/uploads/medium_Risk_reward_2707868678.png"},"small":{"name":"small_Risk reward.png","hash":"small_Risk_reward_2707868678","ext":".png","mime":"image/png","width":500,"height":321,"size":64.93,"url":"/uploads/small_Risk_reward_2707868678.png"}},"hash":"Risk_reward_2707868678","ext":".png","mime":"image/png","size":17.28,"url":"/uploads/Risk_reward_2707868678.png","updatedAt":"2022-10-05T09:34:28.130Z"},"categories":{"data":[]},"author":{}},{"title":"Self Awareness","content":"<p>Your financial literacy and perceptions help you to make your choices. The more self-aware you’ll become of your choices, the more precisely you’ll be able to look after your limits, your capabilities, and your blind spots. Knowing your weaknesses, you can work on them better to overcome or eliminate them.</p><p>Self-awareness is very important in the market, it helps you to observe your mistakes and stop repeating them. Learn the art of differentiating between a rational decision and an emotional decision. Take your decisions based on rational thinking rather than letting fear &amp; greed rule over your verdict.</p><p>Routes you can take to initiate your journey of self-awareness in the market, ask yourself these questions.</p><ul><li>How are you bringing money into the market, at what point ?</li><li>How are you exiting from the trades/ investments?</li><li>How are you deciding what quantity of the stocks will be suitable?</li><li>How are you choosing to withdraw your funds from the market?</li><li>What is your reaction when there is a fall, are you panicking?</li><li>Is gain making you greedy?</li></ul><p>The process of self-awareness will help you to</p><ul><li>Increase self-confidence</li><li>Take analytical decision</li><li>Reduce stress</li><li>Improve motivation</li><li>Build a dynamic approach</li></ul><p>Analyze your decision data to become more self-aware and make correct choices that can be rewarding to you. This journey of self-discovery is never-ending. Always look after your decisions to stay sane and make the required decisions in the market. Before making a trade ask yourself,  are you making a calculative move? Are you confident or are you truly self-aware?</p>","slug":"/self-awareness","componentName":"article","updatedAt":"2022-10-05T09:35:04.391Z","image":{"name":"Self Awareness.png","alternativeText":"Self Awareness.png","caption":"Self Awareness.png","width":812,"height":522,"formats":{"thumbnail":{"name":"thumbnail_Self Awareness.png","hash":"thumbnail_Self_Awareness_9f299a76f8","ext":".png","mime":"image/png","width":243,"height":156,"size":28.86,"url":"/uploads/thumbnail_Self_Awareness_9f299a76f8.png"},"medium":{"name":"medium_Self Awareness.png","hash":"medium_Self_Awareness_9f299a76f8","ext":".png","mime":"image/png","width":750,"height":482,"size":123.81,"url":"/uploads/medium_Self_Awareness_9f299a76f8.png"},"small":{"name":"small_Self Awareness.png","hash":"small_Self_Awareness_9f299a76f8","ext":".png","mime":"image/png","width":500,"height":321,"size":72.99,"url":"/uploads/small_Self_Awareness_9f299a76f8.png"}},"hash":"Self_Awareness_9f299a76f8","ext":".png","mime":"image/png","size":18.28,"url":"/uploads/Self_Awareness_9f299a76f8.png","updatedAt":"2022-09-16T13:57:13.360Z"},"categories":{"data":[]},"author":{}},{"title":"Temperament","content":"<p>“Investing is not a game where the guy with the 160 IQ beats the guy with the 130 IQ. Once you have ordinary intelligence, what you need is the temperament to control the urges that get other people into trouble in investing.”</p><p>—Warren Buffett</p><p>Temperament is an aspect of your personality that involves emotions. There are multiple emotions we pass through depending on the situations around us. When it comes to the stock market, uncertainty, doubts, and regrets are the most common feelings that trigger our emotions. The decision we take is related to the personality we fall in, there are four common types of investors in the market.</p><p><strong>Risk-takers</strong> - The one who bets big time.</p><p><strong>Controlled Risk-takers</strong>- The one who is willing to take very less risk.</p><p><strong>Safe Buyers</strong> - The one who is not willing to take any risk</p><p><strong>Balanced Buyers</strong> - The one who moderately controls both sides.</p><p>The way you react to your emotions determines how long you’ll be able to stay in the market. Investing is not only about gaining financial knowledge but also about maintaining the right temperament. How you manage your money is as important as how you manage your emotions</p><p>As a human being, we are all bound to react, a 5-10% fluctuation in our portfolio can definitely make us happy or sad depending on its direction. But you must always keep in mind that the current price is the truth of the market, you can’t dwell in the past or the future because they don’t matter, the current moment is all that you have in your hands. To know your investing strategy better you can ask yourself these questions.</p><p>Ask yourself</p><p>What is my goal behind making this investment?</p><p>How long am I planning to stay invested?</p><p>What is the drawdown I’ll be able to handle?</p><p>What type of investor category do I fall into?</p><p>Next time when fear, greed, FOMO, panic, uncertainty or any other emotion tries to play with you, let discipline, rational thinking and self-awareness be your guard and help you square up the right decision.</p>","slug":"/temperament","componentName":"article","updatedAt":"2022-10-05T09:35:51.474Z","image":{"name":"temprament.png","alternativeText":"temprament.png","caption":"temprament.png","width":812,"height":522,"formats":{"thumbnail":{"name":"thumbnail_temprament.png","hash":"thumbnail_temprament_c87090e2f1","ext":".png","mime":"image/png","width":243,"height":156,"size":37.33,"url":"/uploads/thumbnail_temprament_c87090e2f1.png"},"medium":{"name":"medium_temprament.png","hash":"medium_temprament_c87090e2f1","ext":".png","mime":"image/png","width":750,"height":482,"size":165.65,"url":"/uploads/medium_temprament_c87090e2f1.png"},"small":{"name":"small_temprament.png","hash":"small_temprament_c87090e2f1","ext":".png","mime":"image/png","width":500,"height":321,"size":98.76,"url":"/uploads/small_temprament_c87090e2f1.png"}},"hash":"temprament_c87090e2f1","ext":".png","mime":"image/png","size":23.12,"url":"/uploads/temprament_c87090e2f1.png","updatedAt":"2022-10-05T09:35:48.255Z"},"categories":{"data":[]},"author":{}},{"title":"The Importance of Risk Management in Investing Journey","content":"<p>Risk management is the process of identifying, understanding, and eliminating the potential risks that can affect your investment. The types of risk that may affect or benefit your investment may vary depending upon the situation and circumstances.</p><p>There are broadly two types of risks</p><ol><li>Systematic Risk</li><li>Unsystematic Risk</li></ol><p>Systematic risk is the one that can not be controlled, it affects the entire market. Eg. - Natural disasters, War, Pandemic, etc. These things can not be predicted in advance or can’t be controlled. While Unsystematic risk is related to one particular company or industry, we can control our loss from it by diversifying our investment into different stocks and sectors.</p><p>Risk Management helps you to prepare for any sort of unexpected future and helps you to minimize the effects if things go south.</p><p>There is always one or another kind of risk involved in every step that you take in the market. A successful investment manages and controls all the risks involved in that investment.</p><p>Once you make your investment, your risk exposure defines the probability of potential losses when things start falling apart.</p><p>Graphics</p><p><strong>The four-step path to managing your risk in the market</strong></p><ol><li>Identify the risk</li><li>Analyze the impact of the risk</li><li>Shift your investments in case required</li><li>Monitor the market constantly</li></ol><p>The risk-takers must define their appetite for taking the risks and make a sane investment according to their capability of holding the right position. Remember- your risk management varies depending on the investment you make, so always keep your eyes and ears open.</p>","slug":"/importance-of-risk-management","componentName":"article","updatedAt":"2022-10-05T09:36:37.456Z","image":{"name":"The Importance of Risk Management in Investing Journey.png","alternativeText":"The Importance of Risk Management in Investing Journey.png","caption":"The Importance of Risk Management in Investing Journey.png","width":812,"height":522,"formats":{"thumbnail":{"name":"thumbnail_The Importance of Risk Management in Investing Journey.png","hash":"thumbnail_The_Importance_of_Risk_Management_in_Investing_Journey_e3a6ded6e1","ext":".png","mime":"image/png","width":243,"height":156,"size":32.81,"url":"/uploads/thumbnail_The_Importance_of_Risk_Management_in_Investing_Journey_e3a6ded6e1.png"},"medium":{"name":"medium_The Importance of Risk Management in Investing Journey.png","hash":"medium_The_Importance_of_Risk_Management_in_Investing_Journey_e3a6ded6e1","ext":".png","mime":"image/png","width":750,"height":482,"size":121.97,"url":"/uploads/medium_The_Importance_of_Risk_Management_in_Investing_Journey_e3a6ded6e1.png"},"small":{"name":"small_The Importance of Risk Management in Investing Journey.png","hash":"small_The_Importance_of_Risk_Management_in_Investing_Journey_e3a6ded6e1","ext":".png","mime":"image/png","width":500,"height":321,"size":77,"url":"/uploads/small_The_Importance_of_Risk_Management_in_Investing_Journey_e3a6ded6e1.png"}},"hash":"The_Importance_of_Risk_Management_in_Investing_Journey_e3a6ded6e1","ext":".png","mime":"image/png","size":13.7,"url":"/uploads/The_Importance_of_Risk_Management_in_Investing_Journey_e3a6ded6e1.png","updatedAt":"2022-10-05T09:36:33.688Z"},"categories":{"data":[]},"author":{}},{"title":"Volatility","content":"<p>Each asset has its own volatile nature based on its market cap and liquidity. Volatility shows the monetary risk associated with a share price, it shows the rate at which a share price can show a movement in a particular period of time.  Volatility can be measured statistically. To understand better you can remember the higher the volatility, the riskier the share.</p><p>If the price of a share fluctuates and touches new highs and lows in a shorter period of time, it can be said that it has higher volatility. And if the price of a share does not change much and stays steady, it can be said that it has low volatility.</p><p><strong>Measures of volatility</strong></p><p><strong>Beta</strong></p><p>Beta is a metric that compares a stock’s movements relative to the overall market, or a certain stock index.</p><p>A high beta stock tends to be more volatile than average, while a low-beta stock tends to be less volatile.</p><p><strong>Volatility Index (VIX)</strong></p><p>India VIX also called the fear index, represents the rank of volatility in the stock market. The volatility typically climbs upwards when there is uncertainty in the market.</p><p>India VIX does not tell you the direction of the market, it just indicates the intensity of the volatility that might impact the market in the coming days.</p><p>High VIX = High Volatility</p><p>Low VIX = Low Volatility</p><p>While Beta is an indicator of stocks, the Volatility Index (VIX) is an indicator of the entire stock index.</p><p><strong>Factors that can affect the volatility</strong></p><p>There are several factors that can play a role when it comes to affecting the volatility measures of a share. The most notable factors are as follows.</p><ul><li>Political factors</li><li>Industrial factors</li><li>Demand &amp; supply of the securities</li><li>Company related news</li></ul><p>Volatility affects you less when you have done enough research and you have full control over your position size, in this case, you can handle extreme volatility and hold your position. You must choose your stocks wisely to minimize the drawdowns. If you have small caps and micro caps as a major portion of your portfolio, you might see a 60-70% drawdown from the top bear market since small caps face a brutal drawdown against large caps. The preferred way can be balancing your portfolio with every category of share to avoid any mishap.</p><p>Volatility provides an opportunity in both uptrends and downtrends. For experienced investors, the right move can turn into an opportunity and benefit in a good way. For a long-term investor, volatility is nothing more than a noise, it is just a basic nature of the market and you have to learn to live with it, as stoic wisdom suggests “ Detach yourself from the daily price action, focus on underlying values &amp; fundamentals of your investment.”</p><p>If you are unsure of how a volatile works in a practical aspect, you can check our Volatility tool and measure the fluctuations of the market.</p>","slug":"/importance-of-volatility","componentName":"article","updatedAt":"2022-10-05T09:37:27.173Z","image":{"name":"volatility.png","alternativeText":"volatility.png","caption":"volatility.png","width":812,"height":522,"formats":{"thumbnail":{"name":"thumbnail_volatility.png","hash":"thumbnail_volatility_dcf34d64b7","ext":".png","mime":"image/png","width":243,"height":156,"size":34.6,"url":"/uploads/thumbnail_volatility_dcf34d64b7.png"},"medium":{"name":"medium_volatility.png","hash":"medium_volatility_dcf34d64b7","ext":".png","mime":"image/png","width":750,"height":482,"size":198.94,"url":"/uploads/medium_volatility_dcf34d64b7.png"},"small":{"name":"small_volatility.png","hash":"small_volatility_dcf34d64b7","ext":".png","mime":"image/png","width":500,"height":321,"size":105.69,"url":"/uploads/small_volatility_dcf34d64b7.png"}},"hash":"volatility_dcf34d64b7","ext":".png","mime":"image/png","size":42.31,"url":"/uploads/volatility_dcf34d64b7.png","updatedAt":"2022-10-05T09:37:21.195Z"},"categories":{"data":[]},"author":{}},{"title":"Why is Research Important?","content":"<p>Research means creating a new concept or using the existing concepts to gain an understanding. Many people make decisions in the stock market only based on the tips they receive from different sources, but oftentimes they do not have a detailed analysis of the subject, which leads to a potential gain or loss that they couldn't justify. Research gives buyers a perspective and a better sense of investing.</p><p>Investment research is important to create a strong portfolio. In the digital era, we have an abundant amount of data available that can be utilized to make a well-informed decision.</p><p><strong>The method of conducting a research</strong></p><p><strong>Identify the company</strong> - Identify and choose the company or industry that you want to study.</p><p><strong>Get the details</strong> - Gather the basic details such as the Net income of the company, Earning Per Share (EPS), TheEarning Per Share (P/E ratio), etc.</p><p><strong>Qualitative research</strong> - Look at the company from a broader perspective such as competitors of the company, management team, history of the company, and how it has performed.</p><p><strong>Conclusion</strong> - After you follow all the above steps, come to a solid conclusion, this will help you not only to understand the market but also take a benefit out of it.</p><p>You should keep in mind the investment you made stands for the long term and this vision shall help you avoid the small fluctuations that come in its way For example, if you’ve invested in a fixed tangible asset, you will not know the change in its value every day, you will just perceive it as an investment whose value can be determined in the long run. The stocks you own are an investment, an asset but you are able to see their value every day, this fluctuating value shouldn't affect your decision if you have a long-term vision backed by strong research. Short term fluctuations in the price of stock has nothing to do with a company's performance, it is just a market sentiment,  your reward or loss is calculated depending upon the growth-degrowth of the company.</p><p>The market can not be predicted, but proper research helps you increase the possibility of making the correct decision. Always remember, instead of following someone blindly, open your eyes and look at every aspect closely before taking a step.</p>","slug":"/importance-of-research","componentName":"article","updatedAt":"2022-10-04T17:08:32.370Z","image":{},"categories":{"data":[]},"author":{}},{"title":"Guaranteed Return","content":"<p>To understand how the stock market gives returns, let’s first understand how the market functions in different scenarios. There are three primary phases of the stock market.</p><p><strong>Bull market</strong> - The price of the securities rises, and market conditions are favourable.</p><p><strong>Bear market</strong> - The economy starts receding and stocks lose their value.</p><p><strong>Sideways/kangaroo market</strong>- Prices keep on rising and falling but not in a consistent direction.</p><p>We all need lots of powerful long-range goals to help us past the short-term goals. If you look at the CAGR return of different assets in the long term and compare it with the short term, you will realise that it is very hard to predict how the market will float in the short term.</p><p>Example:</p><p>(3 different charts of the same asset- RIL)</p><p>5 year chart</p><p>1 year chart</p><p>1 week chart</p><p>Here you can see that it is very hard to make an assumption about how the stock will perform in the long term. The market keeps on fluctuating in different directions, in the short term everything looks haywire, but if you analyze from a long-term perspective you will be able to see the value of the asset has been increasing, it was just not visible on the surface level.</p><p><strong>(Illustration of below given numbers)</strong></p><p>1+1+1+1+1+1 =6</p><p>&amp;</p><p>1+3-2+4-2+2=6</p><p>Most people think the market functions similarly to the first calculation. They fail to understand that the market is never moving at one speed, their wealth will fluctuate with every mood the market goes through. Sometimes it can increase by multiples, while at other times it can decrease as well. Achieving your desired goal is the only thing that matters.</p><p>There are many fraudsters in the market that assure that they are able to provide guaranteed returns in the market. The truth is no one can predict how the market will be in the short run. If someone is offering a guaranteed return then either he is lying or he is fooling you for his own benefit. You should stay alert and not get lured into these types of traps. If you are letting anyone else manage your money on your behalf then don’t give anyone access to your account that is not registered with SEBI.</p>","slug":"/guaranteed-return","componentName":"article","updatedAt":"2022-10-04T17:09:47.936Z","image":{},"categories":{"data":[]},"author":{}},{"title":"The desire to get rich quickly in the stock market","content":"<p>The stock market is not like a casino where your luck decides what your future holds, but it is rather a game of chess where you need to use your knowledge and skills to make your predictions and change them at every step.</p><p>Many new investors jump into the market with the hope of making some quick money and becoming rich. To fulfill this wish they use three main types of investment strategies.</p><ul><li>Penny stocks</li><li>Options trading</li><li>Leverage</li></ul><p>These types of investment strategies definitely give you a very high return but at the same time, they bring stress, anxiety, and sleepless nights. Using these methods for trading has its own pros and cons.</p><p>To create long-term wealth, you must focus on methods that help you compound your investment with time. Compounding leads to reinvesting the gains made from your investment to generate additional income in the long run. This method helps to multiply the initial investment thanks to the profits made along the way. It is a long-term game and you must trust in it completely.</p><p><strong>(Illustration of a snowball getting big with the time)</strong></p><p>Compared to options or leverage, investing in stocks directly is a peaceful way to create long-term wealth. As a new investor in the market, those methods might look lucrative to you, but keep in mind they are wealth makers and destroyers at the same time. Not knowing their consequences may damage or even destroy your portfolio.</p><p>Just like when a snowball is pushed down from a snow-covered hillside, the snow along the way starts making it larger and eventually makes it significantly larger. Compounding your wealth in the stock market works the same way, the value of your initial investment increases as and more you stay in the market and keep on making the right decisions.</p><p>Remember walking on a slow path is not always a bad way, fast does not mean you will reach the destination quickly and stay there forever. Money made quickly can also be rapidly lost. The slow path is secure, your disciple and consistency decide how long you will be surviving in the market. Enter into the market to create wealth, not to be rich. The market is not a short sprint, it's a lifelong marathon.</p>","slug":"/get-rich-quickly","componentName":"article","updatedAt":"2022-10-04T17:10:44.304Z","image":{},"categories":{"data":[]},"author":{}},{"title":"Diversification","content":"<p>Diversification is a method to reduce the risk of your investment by diversifying it into multiple assets. The market reacts to different areas in different ways, and diversifying your investment gives you an edge by covering every area.</p><p>There are four primary asset classes in which you can diversify your investment, namely</p><p>Equity</p><p>Gold</p><p>Real Estate</p><p>Fixed Income</p><p>Your overall net worth should be diversified across all the asset classes, and your allocation should be based on your risk appetite, your age, and your future goals.</p><p>You can use this method to calculate your allocation easily.</p><p>Suppose your age is 25, then you can spare 100-25 = 75% of your investment in equity.</p><p>Since equity can be both highly beneficial or highly unfortunate, the younger you are, the more you can allocate your asset to the equity.</p><p>However this method does not apply to everyone, some of us might have a higher threshold capacity and willingness to take a bigger risk, while some of us might just prefer laying low and avoiding taking a bigger bet.</p><p>(graphical image of the chart-already designed)</p><p>From the above given image, we can see that you can choose to invest and diversify your portfolio in three different manners but if you won’t make the right choice, you will suffer its consequences.</p><p>Creating a concentrated portfolio is like applying your luck while you invest, your investment is split among 3-4 stocks, and your future in the market depends upon how these stocks perform. Sometimes this approach may give you a good return if the sectors you are invested in, start performing well, but if they fall, your loss leaves a bigger hole in your pocket.</p><p>A diversified Portfolio is a much better approach where your stocks are split into 15-20 stocks and spread among 4-5 sectors, here you can keep a track of all of your stocks while feeling safe since if one sector doesn’t perform well, you can rely on another sector for the returns.</p><p>Many investors make the mistake of over-diversifying their portfolio, but they realize their mistake when keeping a track of multiple stocks(50+) becomes difficult. Investing in a large number of stocks keeps your risk on par with a general investor but due to over-diversification, the investor may face a reduction in potential gain.</p><p>While you are making your equity investment, you must keep in mind that investing all of your money in a single-digit stock doesn't make much sense, you should create a portfolio consisting of 15-20 stocks. You should also keep in mind not making the mistake of over-diversifying by adding more than 20 stocks to your portfolio, once you start over-diversifying, your returns might start falling.</p><table><thead><tr><th style=\"text-align:left\"><strong>Market Cap</strong></th><th style=\"text-align:left\"><strong>Return</strong></th><th style=\"text-align:left\"><strong>Volatility</strong></th><th style=\"text-align:left\"><strong>Liquidity</strong></th></tr></thead><tbody><tr><td style=\"text-align:left\">Large Cap</td><td style=\"text-align:left\">Low</td><td style=\"text-align:left\">Low</td><td style=\"text-align:left\">High</td></tr><tr><td style=\"text-align:left\">Mid Cap</td><td style=\"text-align:left\">Medium</td><td style=\"text-align:left\">Medium</td><td style=\"text-align:left\">Medium</td></tr><tr><td style=\"text-align:left\">Small Cap</td><td style=\"text-align:left\">High</td><td style=\"text-align:left\">High</td><td style=\"text-align:left\">Low</td></tr></tbody></table><p>Investing in stock is like playing a game of probability, diversification helps you to stick to the ground when volatility is playing hard against you. Unsystematic risk can be avoided through diversification while the systematic risk is unavoidable. By choosing a low beta stock, diversification can help you lower your volatility.</p><p><strong>Tips to diversify</strong></p><ul><li>Diversify your investment across different asset classes</li><li>Diversify in different sectors and industries</li><li>Diversify across different companies</li><li>Prefer diversifying your investment in 15-20 stocks to keep a sharp eye</li><li>Diversify in different asset classes based on your need and future goals</li></ul><p>Diversification is extremely important because no one can predict how one asset class or a single stock will perform. However it does not ensure your investment will always be safe, it just eliminates the possibility of your investment being wiped out at once due to some negative event in the market.</p>","slug":"/importance-of-diversification","componentName":"article","updatedAt":"2022-10-05T09:25:26.988Z","image":{"name":"diversification.png","alternativeText":"diversification.png","caption":"diversification.png","width":812,"height":522,"formats":{"thumbnail":{"name":"thumbnail_diversification.png","hash":"thumbnail_diversification_a9bb9cf5de","ext":".png","mime":"image/png","width":243,"height":156,"size":49.49,"url":"/uploads/thumbnail_diversification_a9bb9cf5de.png"},"medium":{"name":"medium_diversification.png","hash":"medium_diversification_a9bb9cf5de","ext":".png","mime":"image/png","width":750,"height":482,"size":252.92,"url":"/uploads/medium_diversification_a9bb9cf5de.png"},"small":{"name":"small_diversification.png","hash":"small_diversification_a9bb9cf5de","ext":".png","mime":"image/png","width":500,"height":321,"size":143.8,"url":"/uploads/small_diversification_a9bb9cf5de.png"}},"hash":"diversification_a9bb9cf5de","ext":".png","mime":"image/png","size":42.56,"url":"/uploads/diversification_a9bb9cf5de.png","updatedAt":"2022-10-05T09:25:17.244Z"},"categories":{"data":[]},"author":{}},{"title":"Gambler’s Fallacy","content":"<p>The Gambler’s Fallacy is also known as Monte Carlo Fallacy. A gambler’s fallacy takes place when someone believes that one particular activity is more likely or less likely going to take place because of its immediate history of repetition.</p><p><strong>Example</strong></p><p>Suppose we are flipping a coin that has two sides a head and a tail</p><p>If the coin is flipped 5 times and it shows the head every time, you might pick a tail for your next turn thinking the coin has shown the head multiple times, and now it can turn towards the tail.</p><p>In this situation, you are thinking that an event is more likely going to happen because it has been repeated in a continuous row. However, we know the chances of a coin turning into a head or tail is going to be 50% in every turn, but the choice was based on past results.</p><p>The gambler’s fallacy forces you to take an incorrect step and drive towards a wrong conclusion. You are required to treat each incident independently as the market is unpredictable and there is no assurance that the past patterns/history will help you make the right decision.</p><p>Gambler’s fallacy traps investors into thinking that random events can have predicted results.</p><p>Trading works heavily on gut feeling, research, and luck. It's common among investors to think that if a market has gone up for many consecutive days, it will now go down. Or if a stock they hold has dropped by a lot, it's overdue to go up again.</p><p>Many traders fall for the gambler’s fallacy and start revenge trading when they mount big losses, as soon as they start losing their trades, they double down the quantity in a hope that the market would react otherwise. However there is no assurance, but a constant downfall gives an illusion of an upcoming rise, these kinds of thoughts and trades both can be very harmful in the market.</p><p>The series of past does not guarantee how the future will unfold, hence, learn to treat each activity individually rather than compiling it with the past and making decisions accordingly. The next time when you are making an investment, think of an example of a flipping coin before making your decision.</p>","slug":"/gamblers-fallacy","componentName":"article","updatedAt":"2022-10-05T09:25:59.552Z","image":{"name":"gambler.png","alternativeText":"gambler.png","caption":"gambler.png","width":812,"height":522,"formats":{"thumbnail":{"name":"thumbnail_gambler.png","hash":"thumbnail_gambler_6b65c5b57b","ext":".png","mime":"image/png","width":243,"height":156,"size":18.24,"url":"/uploads/thumbnail_gambler_6b65c5b57b.png"},"medium":{"name":"medium_gambler.png","hash":"medium_gambler_6b65c5b57b","ext":".png","mime":"image/png","width":750,"height":482,"size":73.1,"url":"/uploads/medium_gambler_6b65c5b57b.png"},"small":{"name":"small_gambler.png","hash":"small_gambler_6b65c5b57b","ext":".png","mime":"image/png","width":500,"height":321,"size":44.67,"url":"/uploads/small_gambler_6b65c5b57b.png"}},"hash":"gambler_6b65c5b57b","ext":".png","mime":"image/png","size":8.36,"url":"/uploads/gambler_6b65c5b57b.png","updatedAt":"2022-10-05T09:25:56.550Z"},"categories":{"data":[]},"author":{}},{"title":"Hedge your equity","content":"<p>The market is very unpredictable, you never know which stock is going to rise up while which one might fall. Hedging your equity helps you to lessen your risk and protect your investment against the downside during market disruptions.</p><p>Hedging is a portfolio protection strategy, the profit made from hedge equity revalues and helps you to cover your market losses. Hedging does not prevent negative things from happening in the market, it protects you to some extent if negative things happen.</p><p><strong>Example:</strong></p><p>When you buy insurance for your house, you protect your house against any sort of danger, that doesn’t mean that nothing wrong will happen, but if something adverse happens your insurance cover will help you to be protected against it.</p><p>While deciding how to hedge against your equity you can use different methods such as gold, cash, or cash equivalent, to take a position for your equity investment. Hedging your equity will help you to stay in the market for the long run and you won’t have to think about selling your stocks when the market goes through a bad phase.</p><p>Hedging your equity is a bit different than paying insurance to protect your house. Instead of covering the asset with a term fee or a premium, investors hedge one investment by making another trade.</p><p>A reduction in risk by making a counter investment also leads to a reduction in loss, as you can’t win from both sides.</p><p>Graphics</p><p>Hedges help you accomplish an ideal market exposure where the risks are minimized or covered entirely. If you are investing heavily, obviously you must have made in-depth research from every aspect to ensure your investment is safe. Adding some reliable assets such as gold can work in your favor, as gold has proven best against equity hedges so far.</p><p>Remember, No Hedge is perfect. There is nothing called a perfect hedge, the unpredictability of the market lures the traders to make investments, and the traders make investments based on their prediction, a probability that can benefit them. Since a large chunk of the market runs on calculations it becomes difficult to define the perfect hedge, you can try your best to cover your investments with wise investments, but there is no defined method to follow. You learn to make the right choices along the way!</p>","slug":"/hedge-your-equity","componentName":"article","updatedAt":"2022-10-04T17:16:12.136Z","image":{},"categories":{"data":[]},"author":{}},{"title":"How does our behavior impact our finance?","content":"<p>There are two crucial things in the market, return on investment and risk of losing capital. As an investor, you are always seeking a good return on the investment that you poured in, but there are always multiple emotions that run behind our minds while we make a decision. Some investors get attached to stock or its value and miss out on selling it at the right price and later on regret that decision. While some buy it in overconfidence and face the loss. To avoid such a situation as an investor you should ask yourself this question before selling/buying a stock, will I regret taking this decision?</p><p><strong>Emotions ( Graphics )</strong></p><p>When the investment you made turns into profit, you are moved with joy, but when it shows losses you feel sad. These two emotions play a strong game in your future decisions. The loss always hits harder than the happiness you can derive from gain. Look after your greed and fear before jumping in.</p><p><strong>Hype ( Graphics )</strong></p><p>Investors always run after the stocks that are getting attention in the market, but a true beneficial investment takes every aspect into consideration, not just the hype.</p><p><strong>Market play ( Graphics )</strong></p><p>The market moves on both sides. Many times when a market is climbing up, the investors assume it’ll keep on climbing up, but that’s not always the case. Sooner or later the market shows some dip that may affect your decisions and you must not make a decision solely on the market play.</p><p><strong>Affinities ( Graphics )</strong></p><p>When Vin Diesel says “Family” in the Fast and Furious saga we get goosebumps. The iconic dialogue from the actor surely serves its purpose in the film but in the stock market, it can’t run this way. Just because someone close to you has given you advice you must not trust them blindly.</p><p>You must always look at the situation from a rational perspective. Before making an investment make sure that you are taking a logical decision and not an emotional one.</p>","slug":"/impact-on-finance","componentName":"article","updatedAt":"2022-10-04T17:17:11.746Z","image":{},"categories":{"data":[]},"author":{}},{"title":"How to bring the capital into the market","content":"<p>The stock market looks very lucrative from a distance, every new investor feels tempted when he sees others around them making money from the market. The general FOMO among investors drives them to enter the market. However, an interesting way to note here is that most new investors enter the market when the market is more in a greedy mood. Everyone seems to be earning a high interest and it looks like everything is rosy red until the market enters into a panic mood, that’s where everyone starts making losses and leaves the market.</p><p>Practice makes perfect. Having no experience in the market kills the capital very quickly, you may end up losing all of your investment in a couple of trades if you do not be careful. Hence you should practice first, start slow, and eventually jump into making high-level bets. Just because someone close to you has given you a tip and you trust them, does not mean you should be going all in.</p><p><strong>Lumpsum vs SIP</strong></p><p>Entering the market with a lump sum amount is not a smart way instead one should follow a regular SIP to create wealth that lasts. Lumpsum gives you an advantage of playing with a big amount initially but it also comes at the cost of losing all of it, if things do not work out in your favour. A regular SIP (Systematic Investment Plan) has the advantage of keeping you rooted in the market. Also, keep some excess funds for yourself and do not put all of your savings into the market; it is safe to keep some liquidity on hand.</p><p>The future can not be predicted, it can only be made! Nobody can time the market. Even the mightiest heroes and investors know the volatility and uncertainty of the market. Nobody can say for sure what tomorrow will be bringing next and how the stock prices will move. Hence, a regular investment through SIP will keep you invested without worrying about the market mood.</p><p><strong>Consistency</strong></p><p>Consistency will take you to places where luck will not. You have to stay invested and follow this decision thoroughly during all the ups and downs of the market. This also means baking out of stocks that do not have a future, so you do not feel stuck, but at the same time stay invested in the stocks that help you to increase your wealth.</p><p><strong>The End Goal</strong></p><p>If you wish to retire someday with a hefty amount in your bank account, you must have two main traits, namely patience and persistence. Having a clear goal before entering the market will help you to visualise better. So, set a moderate expectation before investing. Learn and analyse yourself, and see how you are bringing the capital into the market. Are you doing it properly? Does this method need to be changed? Do you have the right expectations from the market? Are you walking properly towards your goal? Remember, if you aim at nothing, you will never hit the target.</p>","slug":"/bring-capital-into-market","componentName":"article","updatedAt":"2022-10-04T17:17:58.789Z","image":{},"categories":{"data":[]},"author":{}},{"title":"How stock prices move","content":"<p>The market is the place where the seller and buyer come together to perform the trade. In the stock market, the price of a share is never fixed at one particular value. Many factors play a pivotal role in driving the price of a stock.</p><p>These factors can affect the market in two different ways, in short term, and in the long term.</p><p><strong>Short term Graphics ( short term price movement )</strong></p><p>These factors affect the price of the share in the short term, and the impact of these factors does not have any lasting effect in the long term, they just fluctuate the price of the share for a shorter span of period.</p><p>(Graphic quote)</p><p>“Invest only if you would be comfortable owning a stock even if you had no way of knowing its daily share price”</p><ul><li>Benjamin Graham, The Intelligent Investor</li></ul><p><strong>Demand &amp; supply</strong> - Higher demand for a share drives its value up or vice versa.</p><p><strong>Market sentiment</strong> - The variable mood of the market has an effect on the share prices.</p><p><strong>Volatility</strong> - The associated risk with a share determines its volatility and price fluctuations.</p><p><strong>Fear &amp; greed</strong> - The emotion of the market influences how much investors are willing to pay.</p><p><strong>Liquidity</strong> - Liquidity refers to the ease with which an asset can be purchased or sold in the market.</p><p><strong>Volume</strong> - The number of shares exchanged in the market in a certain period of time can affect the price of a share.</p><p><strong>Market cap</strong> - The total market value of outstanding shares determines the market cap of the company. The lesser the market cap the stock is more likely to be volatile and vice versa.</p><p><strong>Announcements</strong> -** Big announcements such as big investors jumping in or a company raising funds from institutional investors or good/bad results can affect the price of stocks.</p><p><strong>Long term graphics ( long term price movement )</strong></p><p>These factors affect the price of the share in the long term. In the long run, the fundamentals of a company, integrity of the management, and corporate governance decide where the shares will move gradually. At the end of the day, markets are slaves of earnings and cash flow.</p><p><strong>Fundamentals</strong> - The revenue &amp; profit of the company, its ability to maintain and grow, cashflow reserves, economic strength of competitors &amp; substitutes etc.</p><p><strong>Macro factors</strong> - A positive or negative change in the industry policy by the government can move the market and affect the stock price.</p><p>When you purchase a stock for the long run you show your trust and belief in the company, as an investor, you want your investment to increase and benefit you. Your benefit from the investment depends on how the management of the company makes the decisions.</p><p>These are some of the different factors that affect the value of the stock in a different manner, some of them have a short-term effect, while others affect the stock, in the long run.</p><p>You must consider all of the scenarios before investing. If you have invested in a value stock for the long term and the fundamentals of the company are strong, the small-term fluctuations shouldn't affect your decision. So, when you see the price of a stock moving next time, you know what reasons might be causing it.</p>","slug":"/how-stock-prices-move","componentName":"article","updatedAt":"2022-10-04T17:19:01.984Z","image":{},"categories":{"data":[]},"author":{}},{"title":"Return Expectations from the market","content":"<p>For new investors, setting up the right return from the market is important. Many investors enter the market with the hope to earn a high return and become rich quickly, however not understanding the fundamentals and expecting unrealistic expectations is unsafe and may crush your portfolio.</p><p>The market is uncertain, there is no surety that the stock you pick will be beneficial for you. However, as an investor, it is obvious that you carry certain expectations and hope to make some profit on the amount that you’ve poured in. Setting up the right expectation is an art that combines facts and logical thinking.</p><p><strong>How to set the right expectation?</strong></p><p>There is a famous saying “For us to live life to the fullest in the present, we must be prepared to ask the right questions about our pasts”  Looking at past performance is the best thing you can do to have somewhat expectations from the future. Take a look at Sensex, since the beginning in 1979, Sensex has moved from 100 to 60,000 today (2022) in 43 years. There have been many ups and downs in between but the end result has been fruitful.</p><p>Before setting up the expectation, you must learn how the prices of the share move. The growth in the sales/profit of the company works in the proportion with the share price of the company, though it does not always work that way, If the market is very bullish a 12% growth of a company can give you 30% return and the same growth can give you 4-5% return if the market is in a bearish mood.</p><p>It's advisable to be less attached to your investment and have reasonable expectations when making investments in the market. Being highly attached and having high expectations leads to disappointment when your investment doesn't perform as expected.</p><p>The market cap of the company also plays a big role when it comes to giving returns. Big companies with a giant market cap have high liquidity and stable growth hence they give less but steady returns, and the risk-return ratio in these here is lower compared to the other stocks.</p><p><strong>(Illustration of three types of asset class )</strong></p><table><thead><tr><th style=\"text-align:left\">Type of asset</th><th style=\"text-align:left\">Return in past 10 years (CAGR)</th></tr></thead><tbody><tr><td style=\"text-align:left\">Gold</td><td style=\"text-align:left\">5.7%</td></tr><tr><td style=\"text-align:left\">Sensex</td><td style=\"text-align:left\">13%</td></tr><tr><td style=\"text-align:left\">FD</td><td style=\"text-align:left\">6%</td></tr></tbody></table><p>From the above table we can see that Sensex CAGR returns are higher compared to the other assets. So if you are earning returns equal to that percentage, you should be content with it. Having a higher expectation initially may not be the right path if you are not very familiar with the market. There is no definite path to learning these aspects, you need to walk on this journey to explore a new uncertainty every day.</p>","slug":"/return-expectations","componentName":"article","updatedAt":"2022-10-04T17:19:48.314Z","image":{},"categories":{"data":[]},"author":{}},{"title":"Introduction to the Financial World","content":"<p><strong>What are Financial Markets?</strong></p><p>Financial Market refers to a marketplace or a system that allows buyers and sellers to trade. There are different types of instruments used according to one’s goal and risk appetite.</p><p><strong>Instruments:</strong></p><p>Below are some of the most preferred instruments in the financial world where daily numerous trades take place worldwide. You can understand them better if you imagine the financial world as an amusement park and all the instruments as different rides, the higher thrill the higher returns. Tighten up your seatbelts and let’s dive in!</p><p><code>            </code>( Graphics ; amusement park of financial , Instruments image format  )</p><p><strong>Debt</strong> - For those who do not want to take a big risk, debt provides fixed income along with protection on the investment. You can look at debt as a safe joyride that offers less excitement and more of just an experience, while it might sound dull, you can experience it if you are afraid of roller coasters!</p><p><strong>Gold</strong> - Due to its high reliability it is also known as one of the safest investments. Gold can be compared to a joyride that can guarantee that you’ll get some tickles in your body, You’ll enjoy it and might consider taking the same experience again in the future.</p><p><strong>Equity</strong> - Even though somewhat risky, people choose it to create wealth in the long run. Equity is a big bull standing in front of you! (Pun Intended) You can sit on it for a wild ride and if you know the right tricks, you can come a long way!</p><p><strong>Crypto</strong> - The optimists and early adopters who bet on the future and are ready to take high risk with high volatility. The wildest roller coasters of the park, everyone has an eye on it but few are willing to take the risk and hop in, it might give you a thrill or it might even bring you down.<br>**</p><p>You need to acquire the right knowledge before making your investment. Many aspects such as your financial condition, your risk-taking ability, your future goals, and your timeline of investment play a part in shaping your investment return.</p><p>You also need to understand every aspect of the market to stay sane during ups and downs and make the right choice whenever required.</p><p>Risky bets payoff better but at the same time, one wrong move and you can damage yourself in a dire way. The best trade in the market is always based on your rational thinking to judge the future of a high-risk asset but with the right way of allocating the asset in such a way that you can hold it for a longer period of time without worrying about it.</p>","slug":"/introduction-to-financial-world","componentName":"article","updatedAt":"2022-10-05T09:31:31.566Z","image":{"name":"introduction to financial world.png","alternativeText":"introduction to financial world.png","caption":"introduction to financial world.png","width":1088,"height":592,"formats":{"thumbnail":{"name":"thumbnail_introduction to financial world.png","hash":"thumbnail_introduction_to_financial_world_06c64dc481","ext":".png","mime":"image/png","width":245,"height":133,"size":57.31,"url":"/uploads/thumbnail_introduction_to_financial_world_06c64dc481.png"},"large":{"name":"large_introduction to financial world.png","hash":"large_introduction_to_financial_world_06c64dc481","ext":".png","mime":"image/png","width":1000,"height":544,"size":493.56,"url":"/uploads/large_introduction_to_financial_world_06c64dc481.png"},"medium":{"name":"medium_introduction to financial world.png","hash":"medium_introduction_to_financial_world_06c64dc481","ext":".png","mime":"image/png","width":750,"height":408,"size":318.19,"url":"/uploads/medium_introduction_to_financial_world_06c64dc481.png"},"small":{"name":"small_introduction to financial world.png","hash":"small_introduction_to_financial_world_06c64dc481","ext":".png","mime":"image/png","width":500,"height":272,"size":169.29,"url":"/uploads/small_introduction_to_financial_world_06c64dc481.png"}},"hash":"introduction_to_financial_world_06c64dc481","ext":".png","mime":"image/png","size":72.64,"url":"/uploads/introduction_to_financial_world_06c64dc481.png","updatedAt":"2022-10-05T09:31:22.358Z"},"categories":{"data":[]},"author":{}},{"title":"Leverage and its consequences","content":"<p>In simple terms, leverage can be called debt or borrowed capital. An investor who chooses leverage expects to multiply his investment gain. The investors use leverage to multiply their buying capacity and increase their returns.</p><p>The key matter to keep in mind while opting for leverage is that it helps you to multiply your gain but at the same time it can also multiply your losses if you make a bad investment.</p><p>When you leverage your capital it reduces its value very fast during a losing trade due to the overexposure it faces, the interest cost you pay, and the opportunity cost that you lose. If your investment isn’t enough to cover your interest cost, your end balance always will keep on reducing.</p><p><strong>Example:</strong></p><p>There is a company called “A” and you want to buy its shares. The share is trading at ₹100/- and you have a capital of ₹20,000/- in your hand. Now if you trade normally, you can only own 200 shares, but you are bullish so you buy 400 shares by taking a margin from your broker of ₹20,000/-</p><p>Now you’ve 400 shares, if the amount goes up your potential benefit will double, but if the price of shares falls your losses will also double.</p><p>Suppose the share prices rise to ₹120/-</p><p>Now, if you would’ve invested with your money your profit would’ve stood at ₹4000/-</p><p>But you used margin, so your profit will be ₹8000/-</p><p>The share prices go down to ₹40/-</p><p>If you would’ve invested only your money, you would’ve made a loss of ₹12000/-</p><p>But with the margin will lead you to a loss of ₹24000/-</p><p>The loss cycle does not stop over there, you also have to pay interest on the amount you borrowed to buy more shares. So your total loss will be ₹24000/- + interest amount + brokerage + tax on your investment</p><p>That’s a pretty bad situation to be in!</p><p>Now imagine, if you would have invested in the same share with fully paid-up capital there would've been no pressure on you when prices go down, because your shares can’t be liquidated without your permission, you can hold them as much as you want. Whatever loss you see on your investment going down may be a paper loss that might have taken place because of the overall fall of the market. Once the market is back on its feet, your investment has the chance to lift up again. In this scenario, you have more control over the situation and hence you are not forced to act.</p><p>Leverage is a good tool to pump up your investment but it also has a major risk involved with it. If you are a first-time user you should avoid leveraging capital to make a heavy investment.</p><p>The key is to remain solvent without leveraging. Leverage is merciless, you will get liquidated no matter how strong is your analysis, if the price you entered wasn't right.</p><p>When you trade in leverage, you must calculate beforehand to know what percentage of your capital is exposed to the potential gain/loss. You can use this calculator to know what effect the leverage will have on your portfolio.</p>","slug":"/leverage-and-its-consequences","componentName":"article","updatedAt":"2022-10-04T17:21:43.603Z","image":{},"categories":{"data":[]},"author":{}},{"title":"Opportunity cost","content":"<p>Opportunity cost refers to a benefit that you miss out on by selecting another option. An opportunity cost shows the potential gain that you would’ve got if you had picked an alternative investment.</p><p>Oftentimes, the opportunity cost is easily shadowed by the current loss that investors might be facing.</p><p>Every financial decision that you make in your day-to-day life holds a certain kind of ‘trade value’  e.g. You have ₹100 that you want to spend, now that decision is up to you to choose the right thing that will give you maximum benefit. You can either fill up the fuel in your vehicle or go out and have a coffee, either way, you will miss out on one thing. While deciding on a smaller amount of ₹100 might not make much of a difference, in the stock market an alternative decision of trade can become risky. Supposedly you choose a company that turns into a bad investment and even while the market shows some movement, that particular stock doesn’t show any progress – that becomes an opportunity cost that you’ve to bear for making a bad investment.</p><p><strong>Example:</strong></p><p><strong>Chart 1; range-bound stock</strong></p><p>A range-bound stock is where an investor loses the opportunity of time. The chart given above shows the price of the stock was 72.25 on 9th January 2009, after a period of 11 years on 11th December 2020, the price of the same stock was standing at 72.80. The price didn't move much. Meanwhile, Sensex shot up from 16,000-17,000 in 2009 to close to 46,000 in 2020 but the investor didn’t make any money on his investment.</p><p>The investor has lost more than 11 years in the hope to make money on the stock, if he would’ve made the same investment elsewhere he might have made good money on it.</p><p><strong>Chart 2; Falling knife</strong></p><p>A falling knife investment indicates a scenario where an investor loses his capital in the investment that he made. In the above-given chart, we see an investor made an investment in stock on 17th august 2018 at a price of 393.20 and as of 13th June 2022, the price of the share is 12.80. Here the price of the share fell rapidly soon after the investment, the investor is bound to lose his money on this bet.</p><p>The market is unpredictable and nobody can predict what is going to fall or lift up in the future hence, it is suggested that you keep your portfolio diverse and avoid investing more than 5-7% of your capital in a single company.</p><p>While calculating your returns from your investment, you must consider the opportunity cost of the investment that you are making, in order to reach a fair conclusion. Keep in mind that capital can be regained, but time can't be reclaimed, it is irreversible, so make your decision wisely.</p>","slug":"/opportunity-cost","componentName":"article","updatedAt":"2022-10-04T17:22:50.274Z","image":{},"categories":{"data":[]},"author":{}}],"totalCount":22}